steux/cc2600/headers/dpcplus_frequencies.h
// 1K Frequency Table.
// Fred Quimby, Darrell Spice Jr, Chris Walton 2010
// Converted to C by Bruno Steux 2023
//
// The 1K Frequency Table can contain up to 256 frequency values
//
// Table entries are defined as 2^32*freq/20000
//

// piano key frequencies (s = sharp)

#define A0   1
#define A0s  2
#define B0   3
#define C1   4
#define C1s  5
#define D1   6
#define D1s  7
#define E1   8
#define F1   9
#define F1s  10
#define G1   11
#define G1s  12
#define A1   13
#define A1s  14
#define B1   15
#define C2   16
#define C2s  17
#define D2   18
#define D2s  19
#define E2   20
#define F2   21
#define F2s  22
#define G2   23
#define G2s  24
#define A2   25
#define A2s  26
#define B2   27
#define C3   28
#define C3s  29
#define D3   30
#define D3s  31
#define E3   32
#define F3   33
#define F3s  34
#define G3   35
#define G3s  36
#define A3   37
#define A3s  38
#define B3   39
#define C4   40
#define C4s  41
#define D4   42
#define D4s  43
#define E4   44
#define F4   45
#define F4s  46
#define G4   47
#define G4s  48
#define A4   49
#define A4s  50
#define B4   51
#define C5   52
#define C5s  53
#define D5   54
#define D5s  55
#define E5   56
#define F5   57
#define F5s  58
#define G5   59
#define G5s  60
#define A5   61
#define A5s  62
#define B5   63
#define C6   64
#define C6s  65
#define D6   66
#define D6s  67
#define E6   68
#define F6   69
#define F6s  70
#define G6   71
#define G6s  72
#define A6   73
#define A6s  74
#define B6   75
#define C7   76
#define C7s  77
#define D7   78
#define D7s  79
#define E7   80
#define F7   81
#define F7s  82
#define G7   83
#define G7s  84
#define A7   85
#define A7s  86
#define B7   87
#define C8   88

const frequency unsigned char frequencies[356] = {
	0x00, 0x00, 0x00, 0x00, 0xac, 0x1c, 0x5a, 0x00, 0x68, 0x78, 0x5f, 0x00, 0xb5, 0x25, 0x65, 0x00, 
	0x6e, 0x29, 0x6b, 0x00, 0xb5, 0x88, 0x71, 0x00, 0xfc, 0x48, 0x78, 0x00, 0x07, 0x70, 0x7f, 0x00, 
	0xf4, 0x03, 0x87, 0x00, 0x3c, 0x0b, 0x8f, 0x00, 0xba, 0x8c, 0x97, 0x00, 0xb3, 0x8f, 0xa0, 0x00, 
	0xdb, 0x1b, 0xaa, 0x00, 0x58, 0x39, 0xb4, 0x00, 0xd0, 0xf0, 0xbe, 0x00, 0x6b, 0x4b, 0xca, 0x00, 
	0xdc, 0x52, 0xd6, 0x00, 0x69, 0x11, 0xe3, 0x00, 0xf7, 0x91, 0xf0, 0x00, 0x0f, 0xe0, 0xfe, 0x00, 
	0xe9, 0x07, 0x0e, 0x01, 0x78, 0x16, 0x1e, 0x01, 0x74, 0x19, 0x2f, 0x01, 0x67, 0x1f, 0x41, 0x01, 
	0xb5, 0x37, 0x54, 0x01, 0xb0, 0x72, 0x68, 0x01, 0xa0, 0xe1, 0x7d, 0x01, 0xd6, 0x96, 0x94, 0x01, 
	0xb7, 0xa5, 0xac, 0x01, 0xd2, 0x22, 0xc6, 0x01, 0xee, 0x23, 0xe1, 0x01, 0x1d, 0xc0, 0xfd, 0x01, 
	0xd1, 0x0f, 0x1c, 0x02, 0xf0, 0x2c, 0x3c, 0x02, 0xe9, 0x32, 0x5e, 0x02, 0xcd, 0x3e, 0x82, 0x02, 
	0x6a, 0x6f, 0xa8, 0x02, 0x60, 0xe5, 0xd0, 0x02, 0x41, 0xc3, 0xfb, 0x02, 0xac, 0x2d, 0x29, 0x03, 
	0x6e, 0x4b, 0x59, 0x03, 0xa5, 0x45, 0x8c, 0x03, 0xdd, 0x47, 0xc2, 0x03, 0x3b, 0x80, 0xfb, 0x03, 
	0xa3, 0x1f, 0x38, 0x04, 0xe0, 0x59, 0x78, 0x04, 0xd1, 0x65, 0xbc, 0x04, 0x9b, 0x7d, 0x04, 0x05, 
	0xd5, 0xde, 0x50, 0x05, 0xc1, 0xca, 0xa1, 0x05, 0x82, 0x86, 0xf7, 0x05, 0x57, 0x5b, 0x52, 0x06, 
	0xdd, 0x96, 0xb2, 0x06, 0x4a, 0x8b, 0x18, 0x07, 0xb9, 0x8f, 0x84, 0x07, 0x76, 0x00, 0xf7, 0x07, 
	0x46, 0x3f, 0x70, 0x08, 0xbf, 0xb3, 0xf0, 0x08, 0xa3, 0xcb, 0x78, 0x09, 0x36, 0xfb, 0x08, 0x0a, 
	0xa9, 0xbd, 0xa1, 0x0a, 0x81, 0x95, 0x43, 0x0b, 0x03, 0x0d, 0xef, 0x0b, 0xaf, 0xb6, 0xa4, 0x0c, 
	0xb9, 0x2d, 0x65, 0x0d, 0x93, 0x16, 0x31, 0x0e, 0x73, 0x1f, 0x09, 0x0f, 0xec, 0x00, 0xee, 0x0f, 
	0x8b, 0x7e, 0xe0, 0x10, 0x7f, 0x67, 0xe1, 0x11, 0x45, 0x97, 0xf1, 0x12, 0x6c, 0xf6, 0x11, 0x14, 
	0x53, 0x7b, 0x43, 0x15, 0x02, 0x2b, 0x87, 0x16, 0x06, 0x1a, 0xde, 0x17, 0x5d, 0x6d, 0x49, 0x19, 
	0x73, 0x5b, 0xca, 0x1a, 0x26, 0x2d, 0x62, 0x1c, 0xe6, 0x3e, 0x12, 0x1e, 0xd8, 0x01, 0xdc, 0x1f, 
	0x17, 0xfd, 0xc0, 0x21, 0xfd, 0xce, 0xc2, 0x23, 0x8a, 0x2e, 0xe3, 0x25, 0xd7, 0xec, 0x23, 0x28, 
	0xa6, 0xf6, 0x86, 0x2a, 0x04, 0x56, 0x0e, 0x2d, 0x0c, 0x34, 0xbc, 0x2f, 0xbb, 0xda, 0x92, 0x32, 
	0, 0, 0, 0 };

